export const CONTENT_TYPE_MOVIE = 1
export const CONTENT_TYPE_HTML = 5
export const CONTENT_TYPE_INTRO = 6
export const CONTENT_TYPE_HTML_NO_TITLE = 7
export const CONTENT_TYPE_EDUBASE = 999
export const INTRO_TYPE_STRINGS = [
	{ 핵심정리: 'A' },
	{ 인트로: 'AAA' },
	{ 한눈에정리하기: 'AAB' },
	{ 기본문제: 'AAC' },
	{ 단원마무리문제: 'AAD' },
	{ 단원정리: 'AAE' },
	{ 성취도평가: 'AAF' },
	{ 교과서기본문제: 'AAG' },
	{ 선생님이간다: 'AAH' },
	{ 개념열기: 'I' },
	{ 핵심콕콕: 'M' },
	{ 확인문제: 'T' },
	{ 실험맛보기: 'MAA' },
	{ 교과서알아보기: 'MAB' },
	{ 생활속실험하기: 'MAC' },
	{ 과학송: 'MAD' }, // 20190603 추가요청
	{ 더알아보기: 'MAE' }, // 20190603 추가요청
	{ 실험톡톡: 'MAF' }, // 20190725 추가요청
	{ 개념활동: 'C' },
	{ 개념배우기: 'DAA' },
	{ 교과서읽기: 'DAB' },
	{ 어휘력짱짱: 'G' },
	{ 준비활동: 'Y' },

	{ 웹툰쓱: 'DAC' }, // 20190603 추가요청
	{ 강의쓱: 'DAD' }, // 20190603 추가요청
	{ 정리톡톡: 'DAE' }, // 20190725 추가요청
	{ 핵심대화: 'DAF' }, // 20190814 추가요청
	{ 강의쏙쏙: 'DAG' }, // 20190814 추가요청
	{ 개념정리하기: 'DAH' }, // 20191113 추가요청
	{ 용어로정리하기: 'DAI' }, // 20191113 추가요청
	{ 동화보기: 'VAA' },
	{ 활동하기: 'VAB' },
	{ 생각놀이: 'VAC' }, // 20190123 추가요청
	{ 학습하기: 'VAD' }, // 20190123 추가요청
	{ 동화읽기: 'VAE' }, // 20190603 추가요청
	{ 이야기읽기: 'VAF' }, // 20190705 추가요청
	{ 만들기: 'P' },
	{ 개념다지기: 'PAA' },
	{ 호기심쏙쏙: 'JAA' },
	{ 용어로게임하기: 'JAB' },
	{ '1단원': 'JAC' },
	{ '2단원': 'JAD' },
	{ '3단원': 'JAE' },
	{ '4단원': 'JAF' },
	{ 교과서미리보기: 'JAG' },
	{ 교과서펼쳐보기: 'JAH' },
	{ 용어게임: 'JAI' },
	{ 단원용어게임: 'JAJ' },
	{ 전체미리보기: 'JAK' }, // 20190118 추가요청
	{ 개념떠올리기: 'JAL' }, // 20190118 추가요청
	{ 사회송: 'JAM' }, // 20190603 추가요청
	{ 사회톡톡: 'JAN' }, // 20190705 추가요청
	{ 게임으로확인하기: 'JAO' }, // 20190705 추가요청
	{ '1단계개념': 'JAP' }, // 20190705 추가요청
	{ '2단계연습': 'JAQ' }, // 20190705 추가요청
	{ '3단계실전': 'JAR' }, // 20190705 추가요청
	{ 개념정리: 'JAS' }, // 20190705 추가요청
	{ 교과서활동: 'E' },
	{ 교과서마시기: 'GAA' },
	{ 스토리텔링개념: 'GAB' },
	{ 잘틀리는문제: 'GAC' },
	{ 풀이: 'GAD' },
	{ 서술형문제: 'GAE' },
	{ 응용유형: 'GAF' },
	{ 실력문제: 'GAG' },
	{ 점프유형: 'GAH' },
	{ 개념맛보기: 'GAI' },
	{ 교과서즐기기: 'GAJ' },
	{ 마스터문제: 'GAK' },
	{ 개념강의: 'GAL' },
	{ 개념문제: 'GAM' },
	{ 문제: 'GAN' },
	//                                                    { "서술형문제": "GAO" },
	{ 수준더하기: 'GAP' },
	{ 수학력키우기: 'GAQ' },
	//                                                    { "실력문제": "GAR" },
	//                                                    { "응용유형": "GAS" },
	//                                                    { "잘틀리는문제": "GAT" },
	//                                                    { "점프유형": "GAU" },
	{ 창의융합문제: 'GAV' },
	{ 퀴즈: 'GAW' },
	//                                                    { "풀이": "GAX" },
	{ 종합평가: 'GAY' },
	{ 단원평가: 'GAZ' },
	{ 교과서익히기: 'S' },
	{ 준비하기: 'GBA' },
	{ 익힘책대표문제: 'GBB' },
	{ 기초연습: 'GBC' },
	{ 개념넓히기: 'CBD' },
	{ 빅데이터: 'GBE' }, // 20190123 추가요청
	{ '오픈톡톡!': 'GBF' }, // 20190123 추가요청
	{ 코딩유형문제: 'GBG' }, // 20190214 추가요청
	{ 창의영재문제: 'GBH' }, // 20190214 추가요청
	{ 오픈톡톡: 'GBI' }, // 20190705 추가요청

	{ '재미팡팡!': 'GBJ' }, // 20200115 추가요청
	{ '생각콕콕!': 'GBK' }, // 20200115 추가요청
	{ '정리쏙쏙!': 'GBL' }, // 20200115 추가요청

	{ AI오답게임: 'GIA' }, // 20210719 추가요청

	{ Learningpoint: 'SAA' },
	{ Keypoint: 'SAB' },
	{ Voca: 'SAC' },
	{ Practice: 'SAD' },
	{ CheckUp: 'SAE' },
	{ Game: 'SAF' },
	{ KeySentences: 'SAG' },
	{ LearnMore: 'SAH' },
	{ 'Look&Listen': 'SAI' },
	{ 'Look&Say': 'SAJ' },
	{ MakeaStory: 'SAK' },
	{ MiniTalk: 'SAL' },
	{ ShowTime: 'SAM' },
	{ Story: 'SAN' },
	{ Words: 'SAO' },
	{ 중요문장복습: 'SAP' },
	{ Sentences: 'SAQ' },
	{ FunTalk: 'SAR' }, // 20190128 추가요청
	{ "Let'sRead": 'SAS' }, // 20190128 추가요청
	{ WrapUp: 'SAT' }, // 20190705 추가요청
	{ Sounds: 'SAU' }, // 20190705 추가요청
	{ Chant: 'SAV' }, // 20190705 추가요청

	{ 스토리듣기: 'SAW' }, // 20200115 추가요청
	{ 찬트듣기: 'SAX' }, // 20200115 추가요청
	{ 찬트만들기: 'SAY' }, // 20200115 추가요청
	{ 찬트녹음하기: 'SAZ' }, // 20200115 추가요청
	{ '찾아봐요ABC!': 'SBA' }, // 20200115 추가요청
	{ 'ABCWorksheet!': 'SBB' }, // 20200115 추가요청
	{ '따라써봐요!': 'SBC' }, // 20200115 추가요청
	{ 'Pre-check': 'SBD' }, // 20200115 추가요청 // 20200918 이름 수정요청
	{ Activity: 'SBE' }, // 20200115 추가요청
	{ FullText: 'SBF' }, // 20200115 추가요청
	{ LearntheWords: 'SBG' }, // 20200918 추가요청
	{ Review: 'SBH' }, // 20200918 추가요청

	{ 만들어보기: 'YAA' },
	{ 수행평가따라잡기: 'YAB' },
	{ 음악익히기: 'YAC' },
	{ 체육활동하기: 'YAD' },
	{ 표현하기: 'YAE' },
	{ 看一看: 'ZAA' }, // 20190226 추가요청
	{ 生词: 'ZAB' }, // 20190226 추가요청
	{ 会话: 'ZAC' }, // 20190226 추가요청
	{ 进一步: 'ZAD' }, // 20190226 추가요청
	{ 玩一玩: 'ZAE' }, // 20190226 추가요청
	{ 发音: 'ZAF' }, // 20190919 추가요청
	{ 唱一唱: 'ZAG' }, // 20190919 추가요청
	{ 이야기듣기: 'ZAH' }, // 20190919 추가요청
	{ 한국어자막과보기: 'ZAI' }, // 20190919 추가요청
	{ 중국어자막과보기: 'ZAJ' }, // 20190919 추가요청
	{ 한번에보기: 'ZAK' }, // 20190919 추가요청
	{ 중국문화살펴보기: 'ZAL' }, // 20200625 추가요청

	{ 살펴보기: 'EAA' }, // 20200717 추가요청
	{ 이어보기: 'EAB' }, // 20200717 추가요청
	{ 톺아보기: 'EAC' }, // 20200717 추가요청
	{ 정리하기: 'EAD' }, // 20200717 추가요청

	{ 재미팡팡: 'GBM' }, // 20220316 문구수정
	{ 생각콕콕: 'GBN' }, // 20220316 문구수정
	{ 정리쏙쏙: 'GBO' }, // 20220316 문구수정

	{ 실력탄탄: 'AAI' }, // 20220316 추가요청
	{ 기초문제: 'AAJ' }, // 20220316 추가요청
	{ AI추천문제: 'AAK' }, // 20220316 추가요청
	{ 试一试: 'ZAM' }, // 20220316 추가요청
]
